app/views/users/index.html.erb

	</tr>
<% User.find(:all, :order => 'name').paginate(:page => params[:page]).each do |u| %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1