app/views/users/show.html.erb

				<tr>
					<td><%= User.find(r[0][:user_id]).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1