app/views/users/show.html.erb

SELECT COUNT(*) FROM "results" WHERE ("results".user_id = 1)
---
		<p><strong>Recent Results</strong></p>
<!--		<% unless @user.results.empty? %>