app/controllers/users_controller.rb

  def index
    @title = "All Users"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("encrypted_password", "salt", "name", "created_at", "email", "admin", "updated_at") VALUES ('bb4dcf1cfcfdf0f72789d545da4f834898013b140500519d53457eb79f350a33', '3219f25290c83194b564135a70576d1ffd3cba77acbb528a75fe607028b07a55', 'Nick', '2011-07-24 17:28:32.340887', 'nick@nickwales.co.uk', NULL, '2011-07-24 17:28:32.340887')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'Nick Waless', "updated_at" = '2011-07-01 22:05:16.453407' WHERE "users"."id" = 1

  def show
    @user = User.find(params[:id])
    @results = @user.results.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "results".* FROM "results" WHERE ("results".user_id = 1) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "results" WHERE ("results".user_id = 1)